code-review/NRB_3471_3546/База_Стало/Documents/ФормированиеОтчетаВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеОтчетаВыписки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий350</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>Ценная бумага</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСостояниюНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияКОтправке</Name>
			<Comment>EPAM объект</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИменаВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИДУведомления</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Comment>На начало(0), На конец операционного дня(1)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ФормированиеОтчетаВыписки/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Депонент) И Объект.Депонент.Субброкер Тогда
		ДобавитьКомандуОтправкиОтчетаПоСчетуДепо();
	КонецЕсли;
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
	УстановитьВидимостьИДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	УстановитьВидимостьИДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("Владелец", Объект.Депонент);
	мПараметры = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.СчетаДепо.ФормаВыбора", мПараметры, Элементы.СчетДепо);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьКомандуОтправкиОтчетаПоСчетуДепо()
	
	ИмяКнопки = "ОтправитьОтчетПоСчетуДепоВФорматеXLS";
	КомандаФормы = Команды.Добавить(ИмяКнопки);
	КомандаФормы.Действие = ИмяКнопки;
	
	КнопкаОтправки = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), КоманднаяПанель);
	КнопкаОтправки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаОтправки.Заголовок = "Отправить отчет по счету депо";
	КнопкаОтправки.ИмяКоманды = ИмяКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетПоСчетуДепоВФорматеXLS()
	
	ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Поручения = Новый ТаблицаЗначений;
		Поручения.Колонки.Добавить("Поручение", Новый ОписаниеТипов("ДокументСсылка.Поручение"));
		Поручения.Колонки.Добавить("ВнешнийИсточникДляРСВПоСубклиентам", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВнешниеИсточники"));
		
		Строка = Поручения.Добавить();
		Строка.Поручение = Объект.ДокументОснование;
		Строка.ВнешнийИсточникДляРСВПоСубклиентам = Объект.Депонент.ВнешнийИсточникДляРСВПоСубклиентам;
				
		СформироватьИОтправитьОтчеты(Поручения, НачалоДня(Объект.ДокументОснование.ДатаКонПериода));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИОтправитьОтчеты(Поручения, ДатаОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поручения", Поручения);
	Запрос.Текст = ТекстЗапросаДляВыборкиВыписок();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТаблицаОтчетов = ТаблицаОтчетовВыпискаОбОперацияхПоСчетамДепо(Выборка);

		Если ТаблицаОтчетов = Неопределено Тогда
			Текст = "Данные для формирования отчета не обнаружены. "
					+ СокрЛП(Выборка.ВладелецСчета) + " за " + Формат(Выборка.ДатаОтчета, "ДФ=dd.MM.yyyy");
			ОбщегоНазначения.СообщитьОбОшибке(Текст);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ВнешнийИсточникДляРСВПоСубклиентам) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнен ВнешнийИсточникДляРСВПоСубклиентам " + СокрЛП(Выборка.ВладелецСчета));	// BSLLS:Typo-off
		Иначе
			СведенияДляОтправки = Новый Структура("ТаблицаОтчетов, СчетДепо, ДатаОтчета, ВнешнийИсточникДляРСВПоСубклиентам");	// BSLLS:Typo-off
			СведенияДляОтправки.ТаблицаОтчетов = ТаблицаОтчетов;
			СведенияДляОтправки.СчетДепо = Выборка.СчетДепо;
			СведенияДляОтправки.ДатаОтчета = ДатаОтчета;
			СведенияДляОтправки.ВнешнийИсточникДляРСВПоСубклиентам = Выборка.ВнешнийИсточникДляРСВПоСубклиентам;	// BSLLS:Typo-off
			
			ОтправитьОтчетыВФорматXLS(СведенияДляОтправки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДляВыборкиВыписок()
	
	Возврат "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзПоручения.Поручение КАК Документ.Поручение) КАК Поручение,
	|	тзПоручения.ВнешнийИсточникДляРСВПоСубклиентам КАК ВнешнийИсточникДляРСВПоСубклиентам
	|ПОМЕСТИТЬ втПоручения
	|ИЗ
	|	&Поручения КАК тзПоручения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоручения.Поручение КАК Поручение,
	|	втПоручения.Поручение.ДатаНачПериода КАК ДатаНачПериода,
	|	втПоручения.Поручение.ДатаКонПериода КАК ДатаКонПериода,
	|	втПоручения.ВнешнийИсточникДляРСВПоСубклиентам КАК ВнешнийИсточникДляРСВПоСубклиентам,
	|	ДокВыписка.Ссылка КАК Выписка,
	|	ДокВыписка.МХУведомление КАК МХУведомление,
	|	ДокВыписка.ВладелецСчета как ВладелецСчета,
	|	ДокВыписка.СчетДепо как СчетДепо,
	|	ДокВыписка.ЦБУведомление как ЦБУведомление,
	|	ДокВыписка.ЭмитентУведомление как ЭмитентУведомление
	|ИЗ
	|	втПоручения КАК втПоручения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК ДокВыписка
	|		ПО втПоручения.Поручение = ДокВыписка.ДокументОснование";
	
КонецФункции

&НаСервере
Функция ТаблицаОтчетовВыпискаОбОперацияхПоСчетамДепо(Выборка)
	
	ВыпискаОбОперациях = Отчеты.ВыпискаОбОперацияхСчетамДепо_Новая.Создать();
	ВыпискаОбОперациях.НачПериода = Выборка.ДатаНачПериода;
	ВыпискаОбОперациях.КонПериода = Выборка.ДатаКонПериода;
	ВыпискаОбОперациях.Выписка = Истина;
	ВыпискаОбОперациях.Документооборот = Истина;
	ВыпискаОбОперациях.ВыпискаДокумент = Выборка.Выписка;
	ВыпискаОбОперациях.МХОтбор = Выборка.МХУведомление;
	ВыпискаОбОперациях.МХПоУмолчанию = Ложь;
	ВыпискаОбОперациях.ВидОтчета.Добавить(Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО);
	ВыпискаОбОперациях.ВыводитьФаксимилеВОтчетах = Истина;
	
	ОтборыОтчета = Новый Структура("Клиенты,СчетаДепо", Выборка.ВладелецСчета, Выборка.СчетДепо);
	Для Каждого ЭлементОтбора Из ОтборыОтчета Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ВыпискаОбОперациях.КомпоновщикНастроек.Настройки.Отбор,
																ЭлементОтбора.Ключ, ВидСравненияКомпоновкиДанных.Равно, ЭлементОтбора.Значение);
	КонецЦикла;
	ОтборыОтчета = Новый Структура("Эмитенты,ЦенныеБумаги", Справочники.Контрагенты.ПустаяСсылка(), Справочники.ЦенныеБумаги.ПустаяСсылка());
	Для Каждого ЭлементОтбора Из ОтборыОтчета Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ВыпискаОбОперациях.КомпоновщикНастроек.Настройки.Отбор,
																ЭлементОтбора.Ключ, ВидСравненияКомпоновкиДанных.Равно, ЭлементОтбора.Значение, , Ложь);
	КонецЦикла;														
	
	ТаблицаОтчетов = ВыпискаОбОперациях.ПолучитьПечатныеФормы();

	Если ТаблицаОтчетов <> Неопределено Тогда
		Для Каждого Строка Из ТаблицаОтчетов Цикл
			НовыйДляЭДО	= ВыпискаОбОперациях.ДокументыКЭДО.Добавить();
			НовыйДляЭДО.Клиент			= Строка.Клиент;
			НовыйДляЭДО.СчетДепо		= Строка.СчетДепо;
			НовыйДляЭДО.Основание		= Строка.Основание;
			НовыйДляЭДО.Документ		= Строка.Основание;
			НовыйДляЭДО.АдресТаблицы	= ПоместитьВоВременноеХранилище(Строка.ТабличныйДокумент);
			НовыйДляЭДО.ActionType		= "INS";
		КонецЦикла;
		
		ВыпискаОбОперациях.ПоместитьОтчетыВЭдо();
	КонецЕсли;
	
	Возврат ТаблицаОтчетов;

КонецФункции

&НаСервере
Процедура ОтправитьОтчетыВФорматXLS(СведенияДляОтправки)
	
	ТекстПисьма = "Отчет об операциях по счету ДЕПО " + СокрЛП(СведенияДляОтправки.СчетДепо)
					+ " за " + Формат(СведенияДляОтправки.ДатаОтчета, "ДФ=dd.MM.yyyy");
	
	Для Каждого Строка Из СведенияДляОтправки.ТаблицаОтчетов Цикл
		ИмяФайлОтчета = ПолучитьИмяВременногоФайла("XLS");
		Строка.ТабличныйДокумент.Записать(ИмяФайлОтчета, ТипФайлаТабличногоДокумента.XLS);
		
		СписокВложений = Новый Соответствие;
		СписокВложений.Вставить(ТекстПисьма + ".xls", Новый ДвоичныеДанные(ИмяФайлОтчета));
	
		Попытка
			УдалитьФайлы(ИмяФайлОтчета);
		Исключение
			ИмяСобытия = "Отправка выписки по счету ДЕПО в формате XLS";
			СообщениеВЖурнал = "Не удалось удалить файл " + ИмяФайлОтчета + " после отправки";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , СообщениеВЖурнал);
		КонецПопытки;
	КонецЦикла;
	
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(СведенияДляОтправки.ВнешнийИсточникДляРСВПоСубклиентам).Настройка;
		
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			СписокВложений);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			"Отчет об операциях по счету");
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()
	Элементы.ПоСостояниюНа.Видимость = Документы.Поручение.ЭтоПериодическиеВыпискиОСостоянииСчетаДЕПО(Объект.ДокументОснование);
КонецПроцедуры

#КонецОбласти
